{
  "backend/main.mo": "Actor storing contact form submissions in a map with add, list, and lookup functions.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing descriptive summaries for various frontend components and pages.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining theme checks, routes, assets, and pre‑launch verification steps.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for themes and applying global background and text styles.",
  "frontend/index.html": "Base HTML document setting metadata and loading the React application root.",
  "frontend/src/App.tsx": "Main React entry that configures TanStack Router routes and provides the router.",
  "frontend/src/components/common/Container.tsx": "Reusable layout wrapper applying consistent max‑width and horizontal padding.",
  "frontend/src/components/common/GradientBackground.tsx": "Transparent structural wrapper component retaining layout spacing without gradients.",
  "frontend/src/components/common/InfoCard.tsx": "Card component supporting titles, descriptions, icons, and hover effects.",
  "frontend/src/components/common/OceanAnimatedBackground.tsx": "Renders static and animated ocean background layers plus a readability overlay.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Displays a portrait image with gradient border, glow effect, and size options.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder file for a portrait component.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder file for a portrait component.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder file for a portrait component.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Card that shows the site URL and provides copy‑to‑clipboard and open‑link actions.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Empty placeholder file for a video background component.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with validation, input handling, and backend submission via custom hook.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Displays success or error alerts after a form submission based on status props.",
  "frontend/src/components/home/HeroSection.tsx": "Renders the homepage hero with name, tagline, description, and call‑to‑action buttons.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides responsive site navigation with desktop links and a mobile sheet menu.",
  "frontend/src/components/layout/SiteFooter.tsx": "Shows footer with branding, quick links, contact prompt, and copyright info.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site with header, footer, animated background, and routed content outlet.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Offers tab-based filtering UI to select project categories.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Displays project cards with descriptions, tools, and optional external links.",
  "frontend/src/components/skills/SkillCategory.tsx": "Renders a skill category card containing a list of skill meters.",
  "frontend/src/components/skills/SkillMeter.tsx": "Shows a labeled progress bar representing a skill’s proficiency level.",
  "frontend/src/components/skills/SkillsDetailsSection.tsx": "Displays detailed skill sections with images, descriptions, and key areas.",
  "frontend/src/data/projects.ts": "Defines the Project interface and a list of categorized project entries.",
  "frontend/src/data/skillsDetails.ts": "Defines the SkillDetail interface and exports an array of detailed skill categories with images for multiple skill domains.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, identity loading, and status handling via AuthClient.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a mutation hook that submits contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Configures Tailwind styles, theme variables, dark mode colors, and animated ocean background layers.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple email validation function using a basic regex pattern.",
  "frontend/src/lib/portrait.ts": "Defines centralized portrait image path and alt text with URL-encoded asset handling.",
  "frontend/src/lib/seo.ts": "Provides utilities to set document title and meta tags, including Open Graph metadata.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, portrait, highlights, and descriptive bio content.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with SEO setup, a contact form, and contact info cards within a gradient background.",
  "frontend/src/pages/HomePage.tsx": "Sets homepage SEO metadata and displays the main hero section.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows a filterable projects grid with SEO setup and a skills details section.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a services list with SEO configuration and a CTA section.",
  "frontend/src/pages/SkillsPage.tsx": "Renders the skills details section with SEO setup and a styled header.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins.",
  "project_state.json": "Tracks project metadata, requirements, design changes, issues, and assets for the portfolio site."
}