{
  "backend/main.mo": "Actor canister storing contact form submissions in a map, supporting submit, fetch-all, and fetch-by-name operations.",
  "feature_evidence.json": "Feature evidence report documenting a typography text-shadow removal change and its related files and components.",
  "frontend-file-summaries.txt": "Plain-text map of frontend file paths to their functional summaries for build analysis.",
  "frontend/DEPLOYMENT.md": "Deployment guide covering build steps, verification checklists, known issues, rollback steps, and backend contact form notes.",
  "frontend/index.css": "Tailwind base styles defining CSS variables for light/dark themes and applying global background and text colors.",
  "frontend/index.html": "HTML entry file setting metadata and loading the React application root.",
  "frontend/src/App.tsx": "Configures TanStack Router and defines routes for all main site pages within a shared layout.",
  "frontend/src/components/common/Container.tsx": "Simple layout wrapper providing consistent horizontal padding and max-width.",
  "frontend/src/components/common/GradientBackground.tsx": "Transparent structural wrapper component preserving spacing without gradient effects.",
  "frontend/src/components/common/InfoCard.tsx": "Reusable card component with optional icon, title, description, and content area.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Rounded portrait component with ring, shadow, and gradient glow effects in configurable sizes.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder component file.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder component file.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder component file.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "UI card allowing users to copy or open the site URL with feedback state handling.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Renders static waterfall background and overlay elements for page backdrop.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with validation, controlled inputs, and backend submission via custom hook.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Shows success or error alerts after a contact form submission based on isSuccess and isError flags.",
  "frontend/src/components/home/HeroSection.tsx": "Renders the homepage hero with name, tagline, description, and links to portfolio and contact pages.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides responsive site navigation with desktop buttons and a mobile sheet menu, highlighting the active route.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the footer with branding, quick links, contact prompt, and dynamic copyright plus caffeine.ai attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site with video background, header, routed content outlet, and footer.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Renders tab-based category filters for projects and triggers category changes.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Displays a responsive grid of project cards with titles, descriptions, tools, and optional external links.",
  "frontend/src/components/skills/SkillCategory.tsx": "Shows a skill category card listing multiple skills with progress meters.",
  "frontend/src/components/skills/SkillMeter.tsx": "Displays a skill name with a percentage level using a progress bar.",
  "frontend/src/data/projects.ts": "Defines the Project interface and exports a list of categorized project data with descriptions and tools.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing login state and identity.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a React Query mutation hook that submits contact form data via the backend actor and invalidates related queries.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables, dark mode styles, utility classes, and background effects.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple regex-based email validation function.",
  "frontend/src/lib/portrait.ts": "Defines centralized portrait image path and alt text for consistent usage.",
  "frontend/src/lib/seo.ts": "Provides utilities to set document title and meta tags for SEO and Open Graph data.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, portrait, bio content, and highlight cards.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with SEO setup, contact form, and contact information sections.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page and sets primary SEO metadata.",
  "frontend/src/pages/PortfolioPage.tsx": "Displays a filterable project portfolio with SEO setup and category-based filtering.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with SEO setup, a list of service cards, and a CTA section using shared layout components.",
  "frontend/src/pages/SkillsPage.tsx": "Displays categorized skill groups with SEO setup, using SkillCategory components inside a structured layout.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, fonts, and plugins for layout and UI styling.",
  "project_state.json": "Project state file describing the site’s requirements, theme changes, issues, and existing feature records."
}