{
  "backend/main.mo": "Stores contact form submissions in a map and exposes submit, fetch-all, and fetch-by-name methods.",
  "feature_evidence.json": "Defines feature evidence metadata linking an About page styling update to affected files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference.",
  "frontend/DEPLOYMENT.md": "Deployment checklist covering pre-deploy, post-deploy, testing, performance, assets, and known issues.",
  "frontend/index.css": "Tailwind base configuration defining light/dark theme CSS variables and global background/text styles.",
  "frontend/index.html": "HTML entry file setting metadata and mounting the React app root with main.tsx.",
  "frontend/src/App.tsx": "Configures all application routes using TanStack Router and renders the router provider.",
  "frontend/src/components/blog/ArticleSideBySideLayout.tsx": "Layout component displaying an article's image and content side-by-side with responsive ordering.",
  "frontend/src/components/common/Container.tsx": "Wrapper component providing consistent responsive page padding and max-width.",
  "frontend/src/components/common/GradientBackground.tsx": "Transparent structural wrapper preserving layout spacing without applying gradients.",
  "frontend/src/components/common/InfoCard.tsx": "Reusable card component with optional icon, title, description, and content slots.",
  "frontend/src/components/common/MotionGraphicAnimatedBackground.tsx": "Empty placeholder file for a removed animated background component.",
  "frontend/src/components/common/OceanAnimatedBackground.tsx": "Empty placeholder file for a removed ocean animation background component.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Displays a rounded portrait image with gradient glow and multiple size options.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder file for a right-side portrait component.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder file for a section corner portrait component.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder file for a medium portrait component.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Card that displays the site's URL and provides copy-to-clipboard and open-in-new-tab actions.",
  "frontend/src/components/common/StaticWaterfallBackground.tsx": "Renders the static waterfall background layer and overlay scrim.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Empty placeholder file for a deprecated video background component.",
  "frontend/src/components/contact/ContactForm.tsx": "A contact form component with validation, input handling, and submission using a custom hook, displaying success or error states.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Displays success or error alerts after contact form submission based on props.",
  "frontend/src/components/home/HeroSection.tsx": "Landing page hero section with name, tagline, description, and call-to-action buttons.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive site header with desktop and mobile navigation, highlighting the active route.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with brand info, quick links, contact prompt, and copyright text.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including background, header, main outlet, and footer.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Category filter using tab controls to switch visible project types.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Grid of project cards showing title, description, tools, and optional external link.",
  "frontend/src/components/skills/SkillCategory.tsx": "Displays a skill category card containing multiple skill meters.",
  "frontend/src/components/skills/SkillMeter.tsx": "Renders a skill name with a percentage progress bar.",
  "frontend/src/components/skills/SkillsDetailsSection.tsx": "Renders detailed skill cards with images, descriptions, and categorized bullet points.",
  "frontend/src/data/blogArticles.ts": "Defines the BlogArticle interface and provides an array of detailed blog article objects with metadata and content sections.",
  "frontend/src/data/projects.ts": "Defines the Project interface and exports a list of project entries describing work across legal, business, marketing, design, video, and web categories.",
  "frontend/src/data/skillsDetails.ts": "Defines the SkillDetail interface and provides structured skill categories and descriptions for legal, marketing, design, and video domains.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for managing Internet Identity authentication state, login flow, and stored identities.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that tracks the user's prefers-reduced-motion system setting via a media query listener.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Provides a mutation hook for submitting contact form data to the backend actor and invalidating related queries.",
  "frontend/src/index.css": "Global Tailwind-based styles defining light/dark themes, background images, overlays, and typography overrides.",
  "frontend/src/lib/assetPaths.ts": "Utility functions to normalize static asset paths and provide a fallback image path.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple email validation function using a regex pattern.",
  "frontend/src/lib/portrait.ts": "Exports centralized portrait image path and alt text with URL-encoded asset handling.",
  "frontend/src/lib/seo.ts": "Provides a function to set document title and meta tags, including Open Graph tags, using a helper for creating or updating meta elements.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with biography content, highlight cards, and sets SEO metadata.",
  "frontend/src/pages/blog/BlogDigitalMarketingArticlePage.tsx": "Renders the digital marketing article page, loads article data by slug, sets SEO, handles image fallback, and displays content in a side‑by‑side layout.",
  "frontend/src/pages/blog/BlogGraphicDesignArticlePage.tsx": "Renders the graphic design article page with SEO setup, image fallback handling, and a side‑by‑side layout with the image on the right.",
  "frontend/src/pages/blog/BlogLawLegalArticlePage.tsx": "Displays the law and legal article using fetched article data, applies SEO settings, manages image loading, and renders sections in a side‑by‑side layout.",
  "frontend/src/pages/blog/BlogVideoEditingArticlePage.tsx": "Shows the video editing article page, configuring SEO, image handling, and structured article content in a left‑image side‑by‑side layout.",
  "frontend/src/pages/blog/BlogWebDesignDevArticlePage.tsx": "Renders the web design and development article page, including SEO setup, image fallback, and a right‑image side‑by‑side content layout.",
  "frontend/src/pages/BlogPage.tsx": "Displays a grid of blog articles with images, fallback handling, and sets blog page SEO.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form and contact information section and sets Contact page SEO tags.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage hero section and sets full SEO including Open Graph metadata.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows filterable project grid and skills details while setting Portfolio page SEO.",
  "frontend/src/pages/ServicesPage.tsx": "Lists service offerings with icons and descriptions and sets Services page SEO.",
  "frontend/src/pages/SkillsPage.tsx": "Displays the skills detail section and sets Skills page SEO metadata.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended animations, shadows, and typography, plus plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing redesign tasks, theme/background changes, typography updates, contact info updates, and known deployment issues for a multi-page portfolio site."
}