{
  "backend/main.mo": "Motoko actor implementing a contact form submission system with functions to submit, retrieve all, and get individual submissions by name, using a Map for storage.",
  "feature_evidence.json": "Feature evidence report documenting four requirements related to adding dark background to HeaderNav.tsx for proper text contrast and readability across all devices.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing the static waterfall background, dark header navigation, blog routes, portfolio with 60 projects, and theme token usage for typography.",
  "frontend/DEPLOYMENT.md": "Deployment checklist covering pre- and post-deployment verification steps including build checks, waterfall background, logo-themed typography, blog features, routing, branding, and critical production identifier requirements.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color tokens for background, foreground, card, primary, secondary, muted, accent, destructive, border, and sidebar styles.",
  "frontend/index.html": "HTML entry point with meta tags, Open Graph properties, and page title set to 'Sheik Tonmoy Islam' for the portfolio site.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including home, about, services, skills, portfolio, contact, blog landing, and five blog article sub-pages.",
  "frontend/src/components/blog/ArticleSideBySideLayout.tsx": "Reusable layout component for blog articles with responsive side-by-side image and content columns, supporting left/right image positioning and error handling.",
  "frontend/src/components/common/Container.tsx": "Wrapper component providing consistent horizontal padding and max-width container styling across all pages.",
  "frontend/src/components/common/GradientBackground.tsx": "Refactored transparent wrapper component that no longer applies gradient backgrounds, preserving structure and spacing without visual styling.",
  "frontend/src/components/common/InfoCard.tsx": "Reusable card component with optional icon, title, description, hover effects, and customizable title/description className props for scoped styling.",
  "frontend/src/components/common/MotionGraphicAnimatedBackground.tsx": "Empty file, motion graphic animated background has been removed from the application.",
  "frontend/src/components/common/OceanAnimatedBackground.tsx": "Empty file, ocean animated background has been removed from the application.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Profile portrait component with gradient border and shadow effects, supporting four size options (sm, md, lg, xl) with responsive sizing for xl variant.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty file, right side portrait component has been removed from the application.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty file, section corner portrait component has been removed from the application.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty file, section medium portrait component has been removed from the application.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "A card component that displays the site URL with copy-to-clipboard and open-in-new-tab buttons, showing visual feedback when the link is copied.",
  "frontend/src/components/common/StaticWaterfallBackground.tsx": "Renders a static waterfall background image layer with an overlay for improved text readability.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Empty component file for waterfall video background functionality.",
  "frontend/src/components/contact/ContactForm.tsx": "A contact form component with validation for name, email, subject, and message fields, using React Query for form submission and displaying loading/success/error states.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Displays success or error alerts after contact form submission with appropriate icons and messages.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section displaying Sheik Tonmoy Islam's name, professional titles, call-to-action buttons for portfolio and contact, and statistics showing 6+ skill areas.",
  "frontend/src/components/layout/HeaderNav.tsx": "Sticky header navigation with desktop menu and mobile sheet drawer, highlighting the active route and linking to all main site pages.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with brand section, quick navigation links, contact CTA, and copyright information organized in a three-column grid.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main layout wrapper that combines the static waterfall background, header navigation, page content outlet, and footer.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Tab-based filter component for portfolio projects with categories: all, legal, business, marketing, design, video, and web.",
  "frontend/src/components/portfolio/ProjectImageGallery.tsx": "Image gallery component with navigation controls, thumbnail strip, error handling with fallback images, and automatic aspect ratio management for project images.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Renders a responsive grid of project cards with image galleries, titles, descriptions, external links, and technology badges using shadcn/ui components.",
  "frontend/src/components/skills/SkillCategory.tsx": "Displays a card containing a category title and a list of skills with their proficiency levels using the SkillMeter component.",
  "frontend/src/components/skills/SkillMeter.tsx": "Renders an individual skill with its name, percentage level, and a visual progress bar.",
  "frontend/src/components/skills/SkillsDetailsSection.tsx": "Displays detailed skill information in cards with images, descriptions, and categorized key areas, optionally showing a section heading.",
  "frontend/src/data/blogArticles.ts": "Defines the BlogArticle interface and exports an array of blog articles with metadata, SEO fields, and structured content sections for digital marketing and graphic design topics.",
  "frontend/src/data/projects.ts": "Defines Project and ProjectImage interfaces and exports an array of portfolio projects across legal, digital marketing, graphic design, and other categories with descriptions, tools, and image assets.",
  "frontend/src/data/skillsDetails.ts": "Defines SkillDetail interface and exports detailed skill descriptions for legal, digital marketing, graphic design, and video editing with categorized capabilities and associated images.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous actor instance using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "React hook that detects and tracks the user's prefers-reduced-motion media query preference for accessibility.",
  "frontend/src/hooks/useSubmitContactForm.ts": "React Query mutation hook for submitting contact form data to the backend actor and invalidating related queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom blue-cyan theme variables for light/dark modes, static waterfall background styles, and typography overrides for the about page.",
  "frontend/src/lib/assetPaths.ts": "Utility functions for normalizing asset paths to be production-safe and base-path-aware, handling various URL types and providing fallback image paths.",
  "frontend/src/lib/emailValidation.ts": "Simple email validation function using regex to check for basic email format.",
  "frontend/src/lib/portrait.ts": "Centralized configuration for portrait image source (URL-encoded path) and alt text used across portrait components.",
  "frontend/src/lib/seo.ts": "SEO utility for setting document title (always 'Sheik Tonmoy Islam'), meta descriptions, and Open Graph tags dynamically.",
  "frontend/src/lib/siteUrl.ts": "Computes the canonical shareable URL for the site, extracting and including the base path for subpath deployments.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying biography, portrait, and six highlight cards covering legal, business, marketing, creative, technical skills, and commitment to excellence.",
  "frontend/src/pages/blog/BlogDigitalMarketingArticlePage.tsx": "Blog article page for digital marketing content using side-by-side layout with image on left. Includes back button, article header, sections, and image error handling.",
  "frontend/src/pages/blog/BlogGraphicDesignArticlePage.tsx": "Blog article page for graphic design content using side-by-side layout with image on right. Similar structure to digital marketing page with article sections and fallback image handling.",
  "frontend/src/pages/blog/BlogLawLegalArticlePage.tsx": "Blog article page component for law/legal content that fetches article data by slug, sets SEO metadata, and renders article with side-by-side layout (image left, content right) including intro, sections, and conclusion.",
  "frontend/src/pages/blog/BlogVideoEditingArticlePage.tsx": "Blog article page component for video editing content that fetches article data by slug, sets SEO metadata, and renders article with side-by-side layout (image left, content right) including intro, sections, and conclusion.",
  "frontend/src/pages/blog/BlogWebDesignDevArticlePage.tsx": "Blog article page component for web design/development content that fetches article data by slug, sets SEO metadata, and renders article with side-by-side layout (image right, content left) including intro, sections, and conclusion.",
  "frontend/src/pages/BlogPage.tsx": "Blog listing page that displays article cards in a grid with images, titles, subtitles, and links to individual blog posts with fallback image handling.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form, contact information cards (email, location, WhatsApp), and a share site link card. Uses white text styling overrides for visibility on gradient background.",
  "frontend/src/pages/HomePage.tsx": "Home page that renders the HeroSection component and sets SEO metadata for Sheik Tonmoy Islam's multi-disciplinary professional portfolio.",
  "frontend/src/pages/PortfolioPage.tsx": "Portfolio page displaying filterable project grid by category and a skills details section. Uses white text for headers and black text overrides for project content.",
  "frontend/src/pages/ServicesPage.tsx": "Services page showcasing six professional services (legal, business, marketing, design, video, web) in a grid layout with icons and descriptions, plus a CTA section.",
  "frontend/src/pages/SkillsPage.tsx": "Skills page that displays the SkillsDetailsSection component with a header describing comprehensive professional skills across multiple disciplines.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, extended utilities (shadows, animations, border radius), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for Sheik Tonmoy Islam's portfolio website, documenting completed features related to header navigation dark background and text readability improvements across all device sizes."
}