{
  "backend/main.mo": "Motoko actor storing contact form submissions in a map with submit, list, and lookup functions.",
  "feature_evidence.json": "Feature evidence listing UI changes and associated files for contact page and form styling.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to their high-level behavioral summaries.",
  "frontend/DEPLOYMENT.md": "Deployment checklist covering build, styling, routing, testing, and production verification steps.",
  "frontend/index.css": "Tailwind base/theme tokens and dark mode variables defining global color and layout styles.",
  "frontend/index.html": "HTML entry point setting metadata, root mount node, and main script loader.",
  "frontend/src/App.tsx": "Main React router setup defining all site routes including blog article pages.",
  "frontend/src/components/blog/ArticleSideBySideLayout.tsx": "Two-column article layout with sticky image card and flexible content positioning.",
  "frontend/src/components/common/Container.tsx": "Wrapper component applying consistent max-width and horizontal padding.",
  "frontend/src/components/common/GradientBackground.tsx": "Transparent structural wrapper preserving layout spacing without gradients.",
  "frontend/src/components/common/InfoCard.tsx": "Configurable card component with optional icon, description, and custom text classes.",
  "frontend/src/components/common/MotionGraphicAnimatedBackground.tsx": "Empty placeholder file for a removed animated background component.",
  "frontend/src/components/common/OceanAnimatedBackground.tsx": "Empty placeholder file for an unused ocean background component.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Reusable portrait component with gradient glow, ring styling, and size variants.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder for a right‑side portrait component.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder for a corner portrait component.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder for a medium portrait component.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Card that displays the canonical site URL with copy-to-clipboard and open-link actions.",
  "frontend/src/components/common/StaticWaterfallBackground.tsx": "Renders static waterfall background and overlay for global page readability.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Empty placeholder for a video-based waterfall background component.",
  "frontend/src/components/contact/ContactForm.tsx": "Handles contact form state, validation, and submission using a custom hook and displays errors and status updates.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Displays success or error alerts based on contact form submission results.",
  "frontend/src/components/home/HeroSection.tsx": "Renders the homepage hero section with intro text, call-to-action buttons, and stats.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides responsive site navigation with desktop links and a mobile sheet menu, highlighting the active route.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the footer with branding, quick links, contact prompt, and copyright.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout including background, header, routed content, and footer.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Displays tab-based project category filters and notifies parent on selection changes.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Shows a grid of project cards with titles, descriptions, tools, and optional external links.",
  "frontend/src/components/skills/SkillCategory.tsx": "Displays a skill category card containing multiple skill meters.",
  "frontend/src/components/skills/SkillMeter.tsx": "Renders a single skill progress bar with name and percentage.",
  "frontend/src/components/skills/SkillsDetailsSection.tsx": "Outputs detailed skill sections including images, descriptions, and key areas, with optional heading.",
  "frontend/src/data/blogArticles.ts": "Defines the BlogArticle interface and provides an array of article objects with metadata and structured content sections.",
  "frontend/src/data/projects.ts": "Defines the Project interface and exports a list of project entries with descriptions, categories, tools, and optional links.",
  "frontend/src/data/skillsDetails.ts": "Defines the SkillDetail interface and exports detailed skill categories and descriptions for multiple skill areas.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that detects the user's reduced-motion preference via a media query.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Provides a mutation hook to submit contact form data through the backend actor and invalidate related queries on success.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, color variables, dark mode theming, global styles, and static waterfall background effects.",
  "frontend/src/lib/assetPaths.ts": "Utility functions to normalize asset paths and return a fallback image path.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple email validation function using a regex pattern.",
  "frontend/src/lib/portrait.ts": "Exports a centralized portrait image path with URL encoding and consistent alt text.",
  "frontend/src/lib/seo.ts": "Provides a helper to set document title and meta/OG tags, always overriding the title with a fixed value.",
  "frontend/src/lib/siteUrl.ts": "Computes a canonical site URL based on the current origin and top-level path segment.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with biography content and sets basic SEO metadata.",
  "frontend/src/pages/blog/BlogDigitalMarketingArticlePage.tsx": "Renders the digital marketing blog article using a side‑by‑side layout, loading article data, SEO metadata, and handling image fallback.",
  "frontend/src/pages/blog/BlogGraphicDesignArticlePage.tsx": "Displays the graphic design blog article with SEO setup, dynamic image loading, and a right‑aligned image layout.",
  "frontend/src/pages/blog/BlogLawLegalArticlePage.tsx": "Shows the law and legal blog article, applying SEO metadata, loading content sections, and handling image errors.",
  "frontend/src/pages/blog/BlogVideoEditingArticlePage.tsx": "Renders the video editing blog article with side‑by‑side layout, SEO initialization, and image fallback logic.",
  "frontend/src/pages/blog/BlogWebDesignDevArticlePage.tsx": "Displays the web design and development blog article, setting SEO details and rendering content with a right‑aligned image layout.",
  "frontend/src/pages/BlogPage.tsx": "Displays a grid of blog articles with fallback image handling and sets SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information, a contact form, and sets SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Renders the hero section for the home page and sets full SEO/OG metadata.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows project filters, a portfolio grid, a skills section, and sets SEO metadata.",
  "frontend/src/pages/ServicesPage.tsx": "Lists service offerings with icons and descriptions and sets SEO metadata.",
  "frontend/src/pages/SkillsPage.tsx": "Displays detailed skills content and sets SEO metadata.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugins for a centered container and extended design system.",
  "project_state.json": "JSON snapshot describing the project state, required theme changes, page updates, known issues, and architectural notes for a multi-page portfolio site rebuild."
}