{
  "backend/main.mo": "Motoko actor storing contact form submissions in a map with functions to add, retrieve one, or list all.",
  "feature_evidence.json": "Feature evidence report listing implemented portfolio-image, project-data, and gallery-behavior features with their metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend components and pages.",
  "frontend/DEPLOYMENT.md": "Deployment checklist outlining build, UI, routing, branding, and production identifier verification steps.",
  "frontend/index.css": "Tailwind base layer defining global CSS variables for light/dark themes and applying background/foreground tokens.",
  "frontend/index.html": "HTML entry point setting metadata, title, and mount point for the React app.",
  "frontend/src/App.tsx": "Main router configuration defining all routes, including blog sub-pages, and rendering the RouterProvider.",
  "frontend/src/components/blog/ArticleSideBySideLayout.tsx": "Two-column layout component placing an article image on the left or right with object-contain rendering and error handling.",
  "frontend/src/components/common/Container.tsx": "Simple wrapper component providing consistent responsive horizontal padding and max‑width.",
  "frontend/src/components/common/GradientBackground.tsx": "Transparent structural wrapper maintaining spacing without applying gradient backgrounds.",
  "frontend/src/components/common/InfoCard.tsx": "Reusable card with optional icon, title, description, and customizable text class overrides.",
  "frontend/src/components/common/MotionGraphicAnimatedBackground.tsx": "Empty placeholder file for a removed animated background component.",
  "frontend/src/components/common/OceanAnimatedBackground.tsx": "Empty placeholder file for a removed ocean animation background component.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Circular portrait component with gradient glow, ring styling, and eager-loaded image asset.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder file for a portrait component.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder file for a portrait component.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder file for a portrait component.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Displays the site's URL with copy-to-clipboard and external-link buttons.",
  "frontend/src/components/common/StaticWaterfallBackground.tsx": "Renders static background and overlay layers for the site.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Empty placeholder component for a video background.",
  "frontend/src/components/contact/ContactForm.tsx": "Implements a validated contact form with submission handling and status display.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Shows success or error alerts after a contact form submission.",
  "frontend/src/components/home/HeroSection.tsx": "Hero banner with title, description, stats, and navigation buttons.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive navigation header with desktop links and mobile sheet menu.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, quick links, contact prompt, and copyright.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout combining header, footer, background, and routed content.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Category filter tabs for selecting project types.",
  "frontend/src/components/portfolio/ProjectImageGallery.tsx": "Image gallery with navigation, thumbnails, and fallback handling for errors.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Renders a responsive grid of project cards with images, descriptions, links, and tool badges.",
  "frontend/src/components/skills/SkillCategory.tsx": "Displays a skill category card with a title and a list of skills using SkillMeter components.",
  "frontend/src/components/skills/SkillMeter.tsx": "Shows an individual skill label with a percentage and a progress bar.",
  "frontend/src/components/skills/SkillsDetailsSection.tsx": "Renders detailed skill sections with images, descriptions, and categorized bullet points, optionally with a heading.",
  "frontend/src/data/blogArticles.ts": "Defines the BlogArticle interface and provides structured blog article content with metadata and sections.",
  "frontend/src/data/projects.ts": "Defines project and image interfaces and exports a list of detailed project entries with tools and media.",
  "frontend/src/data/skillsDetails.ts": "Defines skill detail structures and provides categorized skill descriptions with images for multiple domains.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "React hook that detects and updates whether the user prefers reduced motion using a media query listener.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a React Query mutation that submits contact form data via an actor and invalidates related queries on success.",
  "frontend/src/index.css": "Global Tailwind CSS styles, theme variables, dark mode settings, gradient utilities, and static background/typography overrides.",
  "frontend/src/lib/assetPaths.ts": "Utility functions for normalizing asset paths and providing a fallback image path.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple email validation function using a regex.",
  "frontend/src/lib/portrait.ts": "Defines the portrait image path and alt text used across the site.",
  "frontend/src/lib/seo.ts": "Utility for setting page title and meta tags including Open Graph tags.",
  "frontend/src/lib/siteUrl.ts": "Computes the canonical site URL based on the current origin and base path.",
  "frontend/src/main.tsx": "Initializes React root, sets up QueryClientProvider and InternetIdentityProvider, and renders the main App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, biography content, portrait, and skill highlight cards.",
  "frontend/src/pages/blog/BlogDigitalMarketingArticlePage.tsx": "Loads and displays the digital marketing blog article with SEO setup, image handling, and a side‑by‑side layout.",
  "frontend/src/pages/blog/BlogGraphicDesignArticlePage.tsx": "Loads and renders the graphic design blog article using a side‑by‑side layout, including SEO and fallback image handling.",
  "frontend/src/pages/blog/BlogLawLegalArticlePage.tsx": "Renders the law/legal blog article page, loading article data by slug, setting SEO, handling image fallback, and displaying intro, sections, and conclusion in a side‑by‑side layout.",
  "frontend/src/pages/blog/BlogVideoEditingArticlePage.tsx": "Renders the video‑editing blog article page with SEO setup, image loading and fallback, and structured article content displayed in a side‑by‑side layout.",
  "frontend/src/pages/blog/BlogWebDesignDevArticlePage.tsx": "Renders the web‑design/dev blog article page, configuring SEO, image fallback, and presenting article content using a right‑aligned image layout.",
  "frontend/src/pages/BlogPage.tsx": "Displays a grid of blog articles with image fallback handling, SEO setup, and links to individual posts.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with SEO setup, a contact form, and contact details including email, location, and WhatsApp.",
  "frontend/src/pages/HomePage.tsx": "Displays the home page hero section and sets SEO metadata for the main portfolio landing page.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows a portfolio with category filtering, a projects grid, and detailed skills, with SEO initialization.",
  "frontend/src/pages/ServicesPage.tsx": "Lists professional services in a grid with icons and descriptions, along with SEO setup and a CTA section.",
  "frontend/src/pages/SkillsPage.tsx": "Displays a detailed skills section with SEO configuration and a styled header.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, layout, animations, fonts, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks project version, requirements, architectural notes, open issues, and image needs for the site rebuild and theme updates."
}