{
  "backend/main.mo": "Actor storing contact form submissions in a Map with submission, retrieval, and sorted listing functions.",
  "feature_evidence.json": "Feature evidence report listing two features, their files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend React components, pages, and data files.",
  "frontend/DEPLOYMENT.md": "Deployment checklist covering build verification, UI checks, routing, content validation, and production identifier requirements.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying global background and text styles.",
  "frontend/index.html": "HTML entry file setting metadata, root mount element, and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Configures TanStack Router with root layout and routes for all pages including five blog article routes.",
  "frontend/src/components/blog/ArticleSideBySideLayout.tsx": "Two‑column article layout component with a sticky image card and flexible content positioning.",
  "frontend/src/components/common/Container.tsx": "Reusable layout container applying responsive padding and max‑width.",
  "frontend/src/components/common/GradientBackground.tsx": "Structural wrapper component providing spacing without applying gradients.",
  "frontend/src/components/common/InfoCard.tsx": "Card component supporting icons, titles, descriptions, and customizable text classes.",
  "frontend/src/components/common/MotionGraphicAnimatedBackground.tsx": "Empty placeholder file for a motion graphic background component.",
  "frontend/src/components/common/OceanAnimatedBackground.tsx": "Empty placeholder file for an ocean animated background component.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Portrait component with gradient border, shadow, and responsive size options.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder file for a right‑side portrait component.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder file for a corner portrait component.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder file for a medium section portrait component.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Component showing the site URL with copy‑to‑clipboard and external link actions.",
  "frontend/src/components/common/StaticWaterfallBackground.tsx": "Component rendering static waterfall background and overlay layers.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Empty placeholder file for a video background component.",
  "frontend/src/components/contact/ContactForm.tsx": "Implements a contact form with validation, controlled inputs, and submission via a custom hook with status handling.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Displays success or error alerts after contact form submission.",
  "frontend/src/components/home/HeroSection.tsx": "Renders a hero banner with name, roles, description, and CTA buttons for portfolio and contact.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides responsive site navigation with active link highlighting and a mobile sheet menu.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays footer branding, navigation links, contact prompt, and copyright info.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site with header, footer, background, and routed page content.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Renders tab-based filters for selecting project categories.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Shows a grid of project cards with titles, descriptions, tools, and external links.",
  "frontend/src/components/skills/SkillCategory.tsx": "Displays a skill category card with skill meters for each listed skill.",
  "frontend/src/components/skills/SkillMeter.tsx": "Shows an individual skill name with a percentage progress bar.",
  "frontend/src/components/skills/SkillsDetailsSection.tsx": "Renders detailed skill sections with images, descriptions, and key areas.",
  "frontend/src/data/blogArticles.ts": "Defines the BlogArticle interface and provides an array of detailed blog article objects with structured intro, sections, and conclusions.",
  "frontend/src/data/projects.ts": "Declares the Project interface and exports a list of project entries describing work across legal, business, marketing, design, video, and web categories.",
  "frontend/src/data/skillsDetails.ts": "Defines SkillDetail and exports categorized skill descriptions with images for legal, marketing, design, and more.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that tracks the user's system reduced-motion preference using a media query.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Mutation hook that submits contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, waterfall background styles, gradient text, and typography overrides.",
  "frontend/src/lib/assetPaths.ts": "Utility functions for normalizing asset paths and providing a fallback image path.",
  "frontend/src/lib/emailValidation.ts": "Simple email validation using a basic regex pattern.",
  "frontend/src/lib/portrait.ts": "Defines the portrait image source with URL encoding and a shared alt text string.",
  "frontend/src/lib/seo.ts": "Provides a function to set document title and update meta and Open Graph tags dynamically.",
  "frontend/src/lib/siteUrl.ts": "Computes a canonical site URL based on window origin and the first path segment.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, portrait, biography, and highlight sections.",
  "frontend/src/pages/blog/BlogDigitalMarketingArticlePage.tsx": "Renders the digital marketing article page, loading article data, setting SEO, handling image fallback, and displaying content in a side-by-side layout.",
  "frontend/src/pages/blog/BlogGraphicDesignArticlePage.tsx": "Renders the graphic design article page with SEO setup, image fallback, and a side-by-side layout with the image on the right.",
  "frontend/src/pages/blog/BlogLawLegalArticlePage.tsx": "Displays the law and legal article page, including SEO configuration, image handling, and structured article content.",
  "frontend/src/pages/blog/BlogVideoEditingArticlePage.tsx": "Provides the video editing article page, managing SEO, image fallback, and rendering intro and sections in a side-by-side layout.",
  "frontend/src/pages/blog/BlogWebDesignDevArticlePage.tsx": "Renders the web design and development article page with SEO setup, image handling, and right-positioned image content layout.",
  "frontend/src/pages/BlogPage.tsx": "Displays a grid of blog articles with SEO setup, image fallback handling, and routing per article.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact form, contact info, and sets SEO for the Contact page.",
  "frontend/src/pages/HomePage.tsx": "Sets SEO for the home page and renders the hero section.",
  "frontend/src/pages/PortfolioPage.tsx": "Provides a portfolio view with filters, project grid, skills section, and SEO setup.",
  "frontend/src/pages/ServicesPage.tsx": "Lists available services with icons, descriptions, and includes SEO configuration.",
  "frontend/src/pages/SkillsPage.tsx": "Renders a skills overview section and configures SEO for the page.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, typography, and plugin setup for the frontend.",
  "project_state.json": "JSON describing the project’s current state, required theme/background changes, known issues, and architectural notes for the portfolio site."
}