{
  "backend/main.mo": "Motoko actor storing contact form submissions in a map with functions to submit, list, and fetch by name.",
  "feature_evidence.json": "Feature evidence report linking typography-related features to modified frontend CSS and associated components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing major React components, pages, and shared utilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining build steps, verification checklists, and backend contact form details.",
  "frontend/index.css": "Tailwind base CSS defining color tokens, theme variables, and global background/foreground styling.",
  "frontend/index.html": "Base HTML document setting metadata and mounting the React app root.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes using SiteLayout as the root layout.",
  "frontend/src/components/common/Container.tsx": "Simple wrapper component providing consistent responsive layout spacing.",
  "frontend/src/components/common/GradientBackground.tsx": "Transparent structural wrapper preserving layout spacing without applying gradients.",
  "frontend/src/components/common/InfoCard.tsx": "Reusable info card component with optional icon, title, description, and content slot.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Portrait component rendering a styled circular image with gradient glow effects.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder file for a portrait component.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder file for a corner portrait component.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder file for a medium portrait component.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Card allowing users to copy or open the site's URL using clipboard and link buttons.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Renders static waterfall background and overlay layers for page visuals.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form component handling input validation, submission via custom hook, and error states.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Displays success or error alerts after submitting the contact form.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with name, description, CTAs, and highlight stats.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive site header with navigation links and mobile sheet menu.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, quick links, contact prompt, and attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout combining header, footer, background video, and main outlet.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Category filter using tabs to switch visible project types.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Grid displaying project cards with descriptions, tools, and optional links.",
  "frontend/src/components/skills/SkillCategory.tsx": "Card grouping skill meters under a category title.",
  "frontend/src/components/skills/SkillMeter.tsx": "Shows a skill name and percentage using a progress bar.",
  "frontend/src/data/projects.ts": "Defines project data array with titles, descriptions, categories, tools, and links.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a mutation that submits contact form data through the backend actor and invalidates related queries.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, typography effects, and background styling for the app.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple regex-based email validation function.",
  "frontend/src/lib/portrait.ts": "Provides centralized constants for the portrait image source and alt text.",
  "frontend/src/lib/seo.ts": "Utility for setting document title and meta tags including Open Graph data.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with bio content, highlights, portrait, and SEO setup.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form, contact details, share card, and configures SEO.",
  "frontend/src/pages/HomePage.tsx": "Renders the home hero section and initializes SEO metadata.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows a filterable projects grid for the portfolio and sets SEO metadata.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with SEO setup, a services list displayed via InfoCard components, and a CTA section.",
  "frontend/src/pages/SkillsPage.tsx": "Renders the Skills page with SEO setup and a grid of categorized skill lists using SkillCategory components.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, custom colors, animations, typography, container settings, and plugin setup.",
  "project_state.json": "Tracks project configuration, requirements, known issues, and state for updating and redeploying the portfolio site."
}