{
  "backend/main.mo": "Motoko actor storing contact form submissions in a map with functions to add, list, and fetch submissions.",
  "feature_evidence.json": "Report describing implemented features, affected files, components, and related test IDs for image removal and deployment.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend components, pages, and utilities for reference.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining production identifier, pre- and post-deployment checks, troubleshooting, and rollback steps.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and global base styles.",
  "frontend/index.html": "HTML root document setting metadata, SEO tags, and mounting the React application.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for all pages and wraps them in the SiteLayout root route.",
  "frontend/src/components/common/Container.tsx": "Simple layout component that applies responsive horizontal padding and centers content.",
  "frontend/src/components/common/GradientBackground.tsx": "Wrapper component applying one of several CSS gradient background variants to its children.",
  "frontend/src/components/common/InfoCard.tsx": "Reusable card component with optional icon, title, description, and content area.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Empty file reserved for a portrait component, currently containing no implementation.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty file reserved for a portrait component, currently containing no implementation.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty file reserved for a portrait component, currently containing no implementation.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty file reserved for a portrait component, currently containing no implementation.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Component that displays the site URL and provides copy-to-clipboard and open-in-new-tab actions.",
  "frontend/src/components/contact/ContactForm.tsx": "React contact form with validation, state management, and submission handling via useSubmitContactForm.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Displays success or error alerts after contact form submission.",
  "frontend/src/components/home/HeroSection.tsx": "Hero section with name, tagline, description, call‑to‑action buttons, and summary stats.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive site header with desktop and mobile navigation using TanStack Router.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with brand info, navigation links, contact prompt, and dynamic copyright.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper combining header, outlet content, and footer.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Category filter using tabs to select project categories.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Grid of project cards showing titles, descriptions, tools, and optional links.",
  "frontend/src/components/skills/SkillCategory.tsx": "Displays a skill category card containing multiple SkillMeter components.",
  "frontend/src/components/skills/SkillMeter.tsx": "Shows a skill name with a percentage-based progress bar.",
  "frontend/src/data/projects.ts": "Project data list defining project metadata including category, description, tools, and links.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and helpers using Internet Identity, initializing AuthClient and exposing login and logout functionality.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Provides a mutation hook to submit contact form data through the backend actor and refresh related queries.",
  "frontend/src/index.css": "Defines Tailwind CSS setup with custom light and dark theme variables and utility classes.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple regex-based email validation function.",
  "frontend/src/lib/portrait.ts": "Empty placeholder module.",
  "frontend/src/lib/seo.ts": "Provides utilities to set document title and meta tags for SEO and Open Graph data.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with bio content, highlights, and sets SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Displays the contact form, contact details, and sets SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage hero section and applies SEO configuration.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows portfolio projects with category filtering and sets SEO metadata.",
  "frontend/src/pages/ServicesPage.tsx": "Renders the Services page with SEO setup, a list of service cards, and a call‑to‑action section using shared UI components.",
  "frontend/src/pages/SkillsPage.tsx": "Displays categorized skill groups with SEO setup and a responsive grid of SkillCategory components.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, colors, animations, typography, and plugin usage for the project.",
  "project_state.json": "Stores project state, requirements, issues, and architectural notes for building a multi‑page portfolio site."
}