{
  "backend/main.mo": "Implements a canister storing contact form submissions in a Map with functions to submit, list, and fetch submissions.",
  "feature_evidence.json": "Contains feature evidence metadata describing two blog‑related features and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing summarized descriptions of various frontend components and pages.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing production identifier and checklists for theme, blog page, routes, and general verification.",
  "frontend/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes and applies global background and text rules.",
  "frontend/index.html": "HTML entry file setting SEO metadata and loading the React app root.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all site pages and wraps them with the main layout.",
  "frontend/src/components/common/Container.tsx": "Simple layout wrapper adding consistent horizontal padding and max‑width.",
  "frontend/src/components/common/GradientBackground.tsx": "Transparent structural wrapper component maintaining spacing without visual gradients.",
  "frontend/src/components/common/InfoCard.tsx": "Reusable card component displaying a title, optional description, icon, and children.",
  "frontend/src/components/common/OceanAnimatedBackground.tsx": "Renders static and animated ocean wave layers plus a readability overlay.",
  "frontend/src/components/common/ProfilePortrait.tsx": "Portrait component with gradient border, shadow, and size options.",
  "frontend/src/components/common/RightSidePortrait.tsx": "Empty placeholder component.",
  "frontend/src/components/common/SectionCornerPortrait.tsx": "Empty placeholder component.",
  "frontend/src/components/common/SectionMediumPortrait.tsx": "Empty placeholder component.",
  "frontend/src/components/common/ShareSiteLinkCard.tsx": "Card that displays the site URL and provides copy‑to‑clipboard and open‑in‑new‑tab actions.",
  "frontend/src/components/common/WaterfallVideoBackground.tsx": "Empty placeholder component.",
  "frontend/src/components/contact/ContactForm.tsx": "Full contact form with validation, controlled fields, and submission via useSubmitContactForm hook.",
  "frontend/src/components/contact/SubmitStatus.tsx": "Renders success or error alerts after submitting a contact form based on status flags and error message.",
  "frontend/src/components/home/HeroSection.tsx": "Displays the homepage hero with name, tagline, description, stats, and CTA buttons for portfolio and contact pages.",
  "frontend/src/components/layout/HeaderNav.tsx": "Provides responsive site navigation with desktop links and a mobile sheet menu, highlighting the active route.",
  "frontend/src/components/layout/SiteFooter.tsx": "Shows footer with branding, quick links, contact prompt, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site with animated background, header, routed content outlet, and footer.",
  "frontend/src/components/portfolio/ProjectFilter.tsx": "Implements a tabbed filter allowing users to select project categories.",
  "frontend/src/components/portfolio/ProjectsGrid.tsx": "Displays a grid of project cards showing titles, descriptions, tools, and optional external links.",
  "frontend/src/components/skills/SkillCategory.tsx": "Renders a skill category card containing multiple skill meters.",
  "frontend/src/components/skills/SkillMeter.tsx": "Shows a labeled progress bar representing a skill level percentage.",
  "frontend/src/components/skills/SkillsDetailsSection.tsx": "Outputs detailed skill sections with images, descriptions, and key areas using data from skillsDetails.",
  "frontend/src/data/projects.ts": "Defines the Project interface and exports a list of categorized project entries with descriptions, tools, and optional links.",
  "frontend/src/data/skillsDetails.ts": "Defines the SkillDetail interface and exports a detailed list of skill categories with associated metadata and image paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Wraps a mutation that submits contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles, theme variables, dark mode, and animated ocean background effects.",
  "frontend/src/lib/emailValidation.ts": "Exports a simple regex-based email validation function.",
  "frontend/src/lib/portrait.ts": "Defines centralized portrait image source and alt text constants.",
  "frontend/src/lib/seo.ts": "Provides a helper to set document title and meta tags for SEO and Open Graph data.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO setup, profile portrait, highlights, and descriptive bio content.",
  "frontend/src/pages/BlogPage.tsx": "Renders a blog landing page with SEO setup and multiple themed blog sections displayed in card layouts.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form, contact information, and sets SEO metadata for the contact page.",
  "frontend/src/pages/HomePage.tsx": "Sets homepage SEO metadata and renders the hero section.",
  "frontend/src/pages/PortfolioPage.tsx": "Shows a filterable portfolio grid with skills details and sets portfolio SEO metadata.",
  "frontend/src/pages/ServicesPage.tsx": "Renders a list of service info cards with a CTA section and sets services SEO metadata.",
  "frontend/src/pages/SkillsPage.tsx": "Displays detailed skills information and configures SEO for the skills page.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Defines the project’s versioned state, describing theme changes, page updates, image requirements, and known issues for a multi‑page portfolio rebuild. Contains architectural notes and existing feature records guiding the site’s updates and deployment."
}