{
  "kind": "build_request",
  "title": "Apply detailed Skills content (short legal/marketing, detailed design/video/WordPress) with images",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "Update the Skills content to match the user-provided structure: Legal Skills (shorter summary), Digital Marketing (shorter summary), Graphics Design (detailed), Video Editing (basic but detailed), and Website Design (WordPress only, detailed). Replace the current meter-only skill lists with readable detailed sections that include headings, short paragraphs, and bullet lists for categories.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-apply-this"
        ],
        "quotes": [
          "apply this",
          "yes,yes i went shirter, yes i went detailed description"
        ]
      },
      "acceptanceCriteria": [
        "The Skills page no longer shows only percentage meters for the main categories; it shows detailed written content per category.",
        "Legal Skills and Digital Marketing are presented as shortened, portfolio-friendly summaries (not the full long text blocks), while Graphics Design, Video Editing (basic), and WordPress Website Design are presented with detailed descriptions.",
        "The detailed content includes the user-requested items: legal areas (e.g., land, crime, tax), digital marketing items (Facebook page creation/optimization, post scheduling, ads, social media management, SEO, SMM), graphics design categories (logo, banner, flyer, t-shirt, etc.), video editing basic (image add, text writing, etc.), and WordPress website design categories (site builder/development related).",
        "All user-facing text on the updated sections is in English."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Add relevant images/pictures alongside the detailed Skills content by creating one visual per skills category and rendering them as static frontend assets. Each category section/card must display its corresponding image with proper alt text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-apply-this"
        ],
        "quotes": [
          "totall description with image picture."
        ]
      },
      "acceptanceCriteria": [
        "Each of the five skill categories (Legal, Digital Marketing, Graphics Design, Video Editing, WordPress Website Design) displays one image next to/within its section/card.",
        "All images are served from static assets in the frontend (no backend image serving).",
        "All images include meaningful English alt text and do not break layout on mobile/tablet/desktop."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Update the Portfolio page to include (below the projects grid) a new \"Skills Details\" section that reuses the same detailed skill categories and images, since the user requested detailed skills on the portfolio page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-portfolio-skills-request"
        ],
        "quotes": [
          "in this web site my portfolio page are all skill are should be in detail."
        ]
      },
      "acceptanceCriteria": [
        "The Portfolio page includes a visible section labeled \"Skills Details\" (English) beneath the projects grid.",
        "The \"Skills Details\" section displays the same detailed category content and images as the Skills page (no duplicated inconsistent text).",
        "The Portfolio page remains responsive and maintains existing project filtering and grid behavior."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths (including frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui).",
    "Keep backend architecture single-actor; no backend changes are required for this request.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Do not add new authentication methods beyond Internet Identity.",
    "Do not add external integrations (email sending, analytics, third-party CMS, etc.).",
    "Do not change contact form persistence behavior or backend schema."
  ],
  "imageRequirements": {
    "required": [
      "Photorealistic legal-themed skills illustration (skills-legal.dim_1200x800.png)",
      "Photorealistic digital marketing-themed skills illustration (skills-digital-marketing.dim_1200x800.png)",
      "Photorealistic graphic design-themed skills illustration (skills-graphic-design.dim_1200x800.png)",
      "Photorealistic basic video editing-themed skills illustration (skills-video-editing.dim_1200x800.png)",
      "Photorealistic WordPress website design-themed skills illustration (skills-wordpress-webdesign.dim_1200x800.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}