{
  "kind": "build_request",
  "title": "Remove global text-shadow for clearer typography across all pages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Remove the global site-wide typography text-shadow so that headings and body text render with no text-shadow across all routes/pages (Home, About, Services, Skills, Portfolio, Contact) for clearer readability over the waterfall background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "should the text‑shadow be removed,I can apply it globally",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/index.css`, the global typography rule that applies `text-shadow` to elements (e.g., h1–h6, p, span, a, li, label, div[class*=\"text\"]) is removed or updated so `text-shadow` is not applied.",
        "No headings or body text on any page shows a text-shadow in the browser (verify at least Home, About, Services, Skills, Portfolio, Contact).",
        "The waterfall background and overlay remain unchanged and continue to sit behind all page content (no interaction blocking).",
        "Typography remains readable after shadow removal; if any text becomes hard to read, adjust only global color tokens (e.g., `--foreground`, `--muted-foreground`) rather than adding back shadows or page-specific overrides."
      ]
    }
  ],
  "constraints": [
    "Do not edit any frontend files under `frontend/src/components/ui` (compose them only).",
    "Do not edit files listed as immutable in SYSTEM_CONTEXT (e.g., `frontend/src/main.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/hooks/useInternetIdentity.ts`).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change page content, routing, or site structure.",
    "Do not change the waterfall background image, overlay design, or replace assets.",
    "Do not add new animations, fonts, or third-party libraries."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}