{
  "kind": "build_request",
  "title": "Update global typography to more saturated color with subtler shadow (site-wide, including About)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "Update the site-wide typography visibility styling so headings and body text use the same more-saturated text color and a lighter/subtler (lower-contrast) text-shadow compared to the current strong, high-contrast shadow, across all routes/pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "headings and body text should use the same stronger‑color, low‑contrast, low‑shadow visibility style across the entire site.",
          "lighter/subtler compared , simply more saturated"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/index.css`, the global text-shadow applied to typography elements is reduced to a subtler/lower-contrast shadow than the current heavy multi-layer shadow.",
        "The primary readable text color used across the site is adjusted to be more saturated while remaining readable over the static waterfall background.",
        "Headings and body text share the same visibility treatment (no separate/stronger shadow rules for headings vs paragraphs).",
        "No page requires per-page overrides to achieve readability; the global rule applies consistently."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Ensure the About page typography is clearly visible and looks good using the same global typography visibility styling (no special-case styling unique to the About page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "about page font must be visible and looking great.",
          "about page the rest of the site once updated?"
        ]
      },
      "acceptanceCriteria": [
        "On `frontend/src/pages/AboutPage.tsx`, the main header, subtitle, and biography paragraphs are readable over the waterfall background using the same global typography styling as other pages.",
        "Common secondary text styles used on the About page (e.g., `text-foreground/80`, `text-foreground/70`, or similar muted treatments) remain readable after the global adjustments.",
        "No About-page-only CSS rules are introduced for readability; improvements come from global tokens/styles or global typography rules."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under the frontend immutable paths list (e.g., `frontend/src/main.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/hooks/useInternetIdentity.ts(x)`, and `frontend/src/components/ui`).",
    "Keep the static waterfall background implementation intact (do not change background image URL/path or overlay layering behavior).",
    "Backend is single-actor Motoko; no backend changes are required for typography-only updates."
  ],
  "nonGoals": [
    "Changing site content/copy, page structure, routing, or navigation.",
    "Replacing or regenerating the waterfall background image asset.",
    "Adding new fonts or redesigning the overall theme beyond the requested color saturation and shadow subtlety adjustments."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}