{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Global typography visibility refresh (more saturated color, subtler shadow)",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Adjust global typography visibility treatment to use a more saturated readable text color and a subtler/lower-contrast text-shadow shared by headings and body text site-wide.",
      "acceptanceCriteria": [
        "In `frontend/src/index.css`, the global text-shadow applied to typography elements is reduced to a subtler/lower-contrast shadow than the current heavy multi-layer shadow.",
        "The primary readable text color used across the site is adjusted to be more saturated while remaining readable over the static waterfall background.",
        "Headings and body text share the same visibility treatment (no separate/stronger shadow rules for headings vs paragraphs).",
        "No page requires per-page overrides to achieve readability; the global rule applies consistently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global theme tokens (notably `--foreground` / `--muted-foreground`) to a slightly more saturated, still-readable color over the existing waterfall background, and replace the current heavy multi-layer `text-shadow` with a lighter, lower-contrast shadow applied uniformly to typography elements (no separate heading vs body rules)."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Confirm About page typography remains clearly visible using only the updated global typography styling (no About-only readability rules).",
      "acceptanceCriteria": [
        "On `frontend/src/pages/AboutPage.tsx`, the main header, subtitle, and biography paragraphs are readable over the waterfall background using the same global typography styling as other pages.",
        "Common secondary text styles used on the About page (e.g., `text-foreground/80`, `text-foreground/70`, or similar muted treatments) remain readable after the global adjustments.",
        "No About-page-only CSS rules are introduced for readability; improvements come from global tokens/styles or global typography rules."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure the global typography visibility rule and global color tokens also cover typical About-page content styling (including muted `text-foreground/70` and `text-foreground/80` usage and typography elements produced by Tailwind Typography's `prose` classes) so the About page remains readable without introducing page-specific styling."
        }
      ]
    }
  ]
}